In [3]:
import pandas as pd
import numpy as np

In [5]:
data = {
    "nome": ["Téo", "Nah", "Lah", "Mah", "Jo"],
    "idade": [31,32,34,12,np.nan],
    "renda":[np.nan,3245,357,12432,np.nan]
}

df = pd.DataFrame(data)
df

  nome  idade    renda
0  Téo   31.0      NaN
1  Nah   32.0   3245.0
2  Lah   34.0    357.0
3  Mah   12.0  12432.0
4   Jo    NaN      NaN

Explicação do código abaixo
-

estamos passando nosso dataframe na posição da coluna idade, logo após estamos verificando nao valores e somoando quantos nao valores apararecem.

In [8]:
df["idade"].isna().sum()

1

quando passamos um df inteiro para um .isna() ele nos retorna o df mas com true ou false no caso a verificao dos valores naquela posicao.

In [11]:
df.isna()

    nome  idade  renda
0  False  False   True
1  False  False  False
2  False  False  False
3  False  False  False
4  False   True   True

quando ao inves de passarmos apenas uma coluna no isna, passarmos um df inteiro e soma-lo em seguida, obteremos um a serie aonde o indece sao os nomes das colunas e suas correspondencias sao os valoeres de nans dentro delas. 

isso porque .isna() nos retorna uma tabela, mas sum() retorna apenas as somas, no caso aqui vem com os nomes pois ele retorna os numeros de soma correspondete a tal local do DF.

In [14]:
df.isna().sum()

nome     0
idade    1
renda    2
dtype: int64

se quisermos apenas uma medias de quantas vez aquilo aparece?
-

bom a melhor forma e por apos o isna(), ele passara no data frame e trara um booleano de nans e o .mean() fara uma media dos valores true de cada coluna, retornando uma serie com resultados de cada coluna.

In [17]:
df.isna().mean()

nome     0.0
idade    0.2
renda    0.4
dtype: float64

como preencher os valores NANS?
-
 usado para analise de dados apenas 
-
de forma simples passamos um .filna() no df, para o tratamento dos NANs, podemos passar dentro dele um escalar EX: 0, como tbm um dicionario como no exemplo abaixo.

explicacao do codigo abaixo

- estamos passandoo df para um fillna que adiciona valores em valor NANs (nao valores), logo apos estamos passando uma lista informando que idade recebera nos seus valores nulos a tabela idade como parametro e em seguida definindo que sua media entrara nos valores (a media da coluna idade no total) e o mesmo para renda.
- detalhe ele retorna um df novo

In [22]:
df.fillna({
    "idade": df['idade'].mean(),
    'renda': df['renda'].mean(),
})

  nome  idade         renda
0  Téo  31.00   5344.666667
1  Nah  32.00   3245.000000
2  Lah  34.00    357.000000
3  Mah  12.00  12432.000000
4   Jo  27.25   5344.666667

dropna remove a linha inteira que contenha um nans

In [26]:
df.dropna()

  nome  idade    renda
1  Nah   32.0   3245.0
2  Lah   34.0    357.0
3  Mah   12.0  12432.0

codigo abaixo explicado 

- estamos passsando o df em um dropna dentro dele passando um subset que seve para ele considerar fazer a busca e logo a pos passamos um how que determina que todas as linhas que contenhan nan deve remover.
- o subset mantem todas as outras colunas nao especificadas iguais e nao mexe nelas, ele considera e mexe apenas nas especificdas.
- 'vc vai remover as linhas em que tanto idade quanto renda sao NANs'

- detalhe sobre how no subset quando colocamos 'all' estamos dizendo que para ele deletar a linha todas precisam ser a condicao, mas caso queira que ao menos uma seja necess

In [37]:
df.dropna(subset= ['idade', 'renda'], how= 'all')

  nome  idade    renda
0  Téo   31.0      NaN
1  Nah   32.0   3245.0
2  Lah   34.0    357.0
3  Mah   12.0  12432.0

explicacao do codigo abaixo

- estamos passando df e um dropna que e utilizado para remover nans dentro dele estamos passando o axis = 1 que determina que sera lido linha por linha e um thresh que determina que levaram conta quantos valores nao nulos vao determinar se sera excluido ou nao no caso ali determinamos que cada coluna precisa de 3 para nao ser excluida.
- exclua todos que a linha esteja nula e a coluna tenha menos de 3 nao nulos.

In [48]:
df.dropna(axis=1, thresh =3)

  nome  idade    renda
0  Téo   31.0      NaN
1  Nah   32.0   3245.0
2  Lah   34.0    357.0
3  Mah   12.0  12432.0
4   Jo    NaN      NaN